Tekla.Structures.Drawing.PrintHandler.PrintDrawingOperation(Tekla.Structures.Drawing.DrawingHandler,System.Collections.Generic.IEnumerable{Tekla.Structures.Drawing.Drawing},System.Collections.Generic.IEnumerable{Tekla.Structures.Drawing.DPMPrinterAttributes},System.Collections.Generic.IEnumerable{System.String},System.String)
The print drawing operation using the DPMPrinterAttributes and
corresponding external printing functionality. If the given drawing
is not the active drawing, it will set it to be active but hidden,
and will then close it.
drawingHandler: The drawing handler.
drawings: The drawings.
printerAttributesList: The printer attributes list.
fileNames: Optional output file names for PDF printing. Overrides attributes output file name.
OutputFolder: Output folder.
Throws System.ArgumentNullException: Throws if any arguments are null.
Throws System.ArgumentException: Throws if drawings, printerAttributesList and fileNames are not equal length.
Throws System.ArgumentException: Throws if drawings or printerAttributesList contain null values.
Returns: A list of the result of each drawing, true if successful.

Tekla.Structures.Drawing.PrintHandler.PrintActiveDrawingOperation(Tekla.Structures.Drawing.DPMPrinterAttributes,System.String)
The print drawing operation using the DPMPrinterAttributes and corresponding external printing
functionality. Prints the currently active drawing.
printerAttributes: The printer attributes.
fileName: Optional output file name for PDF printing. Overrides attributes output file name.

Tekla.Structures.Drawing.PrintHandler.CheckArgumentsAreNotNull(System.Tuple{System.Object,System.String}[])
Check if any arguments are null.
arguments: The arguments as a tuple of the argument value and the argument name.
Throws System.ArgumentNullException: Throws ArgumentNullException on the first argument value that is null.

Tekla.Structures.Drawing.PrintHandler.GetCommandlineArguments(Tekla.Structures.Drawing.DPMPrinterAttributes,System.String)
Creates the command line arguments from the given printerAttributes.
printerAttributes: The printer attributes.
fileName: Optional output file name for PDF printing. Overrides attributes output file name.

Tekla.Structures.Drawing.PrintHandler.GetPrinter(Tekla.Structures.Drawing.DotPrintOutputType,System.String)
Creates a string based on the given input enum.
outputType: The outputType enum.
printerName: The printer name.

Tekla.Structures.Drawing.PrintHandler.GetPaperSize(Tekla.Structures.Drawing.DotPrintPaperSize)
Creates a string based on the given input enum.
paperSize: The paperSize enum.

Tekla.Structures.Drawing.PrintHandler.GetScalingMethod(Tekla.Structures.Drawing.DotPrintScalingType)
Creates a string based on the given input enum.
scalingMethod: The outputType enum.

Tekla.Structures.Drawing.PrintHandler.GetOrientation(Tekla.Structures.Drawing.DotPrintOrientationType)
Creates a string based on the given input enum.
orientationType: The outputType enum.